; domain
(define (domain default)
  (:requirements :strips :typing)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (free_arms ?a - agent) ; Indicates that agent ?a has free arms (not carrying a box).
    (available ?b - box) ; Indicates that ?b, a box, is available to be carried.
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action load_box
    :parameters (?a - agent ?wh - warehouse ?b - box ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
      (free_arms ?a)  ; Agent ?a must have free arms.
      (available ?b)  ; Box ?b must be available.
      (at ?b ?l)  ; Box ?b must be at ?l location.
    )
    :effect (and 
      (not (free_arms ?a))  ; Agent ?a no longer has free arms.
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (not (available ?b))  ; Box ?b is no longer available.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.
    )
  )
  
  (:action leave_box
    :parameters (?a - agent ?b - box ?wh - warehouse ?l - location)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
    )
    :effect (and 
      (at ?b ?l)  ; Box ?b is now at ?l location.
      (free_arms ?a)  ; Agent ?a has free arms again.
      (available ?b)  ; Box ?b is now available.
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
    )
  )

  (:action load_supply_to_workstation
    :parameters (?a - agent ?ws - workstation ?b - box ?s - supply ?l - location ?t - supply_type)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (empty ?b)  ; Box ?b is now empty.
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )

  (:action fill_box
    :parameters (?a - agent ?wh - warehouse ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )
)

; problem
;; problem file: problem_2.pddl
(define (problem default)
  (:domain default)
  (:objects l1_4 l2_0 l0_6 l1_3 l1_2 l3_2 l2_2 l3_0 l0_3 l0_5 l4_4 l1_1 l2_3 l0_7 l0_4 l1_0 l0_2 l3_3 l2_4 l1_5 l0_0 l3_1 l2_1 l3_4 l2_5 - location agent_0 - agent supply_3 supply_14 supply_9 supply_0 supply_11 supply_1 supply_8 supply_7 supply_12 supply_6 supply_4 supply_2 supply_13 supply_10 supply_5 - supply box_6 box_0 box_4 box_5 box_1 box_7 box_2 box_9 box_8 box_3 - box workstation_2 workstation_0 workstation_1 - workstation warehouse_0 - warehouse gear circuit bolt tool valve - supply_type )
  (:init (adjacent l1_4 l2_4) (empty box_3) (at supply_14 l3_3) (adjacent l2_1 l2_2) (adjacent l3_1 l3_0) (adjacent l0_5 l1_5) (is supply_1 valve) (at supply_0 l3_3) (adjacent l0_3 l1_3) (adjacent l2_0 l2_1) (at box_4 l3_3) (available box_5) (adjacent l2_2 l2_1) (at box_0 l3_3) (adjacent l2_5 l1_5) (loaded_to supply_10 workstation_1) (available box_8) (at workstation_0 l0_0) (adjacent l3_3 l3_4) (is supply_12 circuit) (at box_9 l3_3) (at supply_11 l3_3) (at workstation_2 l3_0) (adjacent l2_4 l2_5) (adjacent l1_3 l0_3) (loaded_to supply_13 workstation_1) (adjacent l1_2 l0_2) (is supply_2 valve) (adjacent l2_4 l3_4) (is supply_6 tool) (adjacent l0_7 l0_6) (adjacent l1_5 l2_5) (empty box_9) (adjacent l2_5 l2_4) (is supply_13 circuit) (at supply_12 l3_3) (adjacent l2_4 l2_3) (adjacent l3_3 l2_3) (adjacent l0_3 l0_4) (is supply_7 tool) (adjacent l1_0 l2_0) (adjacent l1_3 l2_3) (adjacent l2_3 l2_2) (available box_1) (adjacent l3_3 l3_2) (at supply_10 l3_3) (is supply_14 circuit) (empty box_7) (adjacent l0_2 l0_3) (empty box_6) (available box_0) (adjacent l1_1 l1_2) (empty box_2) (at box_6 l3_3) (adjacent l1_2 l1_1) (adjacent l0_4 l0_5) (empty box_0) (is supply_11 gear) (available box_9) (adjacent l0_4 l0_3) (at supply_6 l3_3) (adjacent l1_1 l1_0) (adjacent l3_1 l2_1) (adjacent l3_2 l3_1) (at box_1 l3_3) (adjacent l2_0 l3_0) (at box_5 l3_3) (is supply_5 bolt) (adjacent l2_4 l1_4) (is supply_8 tool) (at supply_9 l3_3) (empty box_5) (is supply_9 gear) (adjacent l0_3 l0_2) (loaded_to supply_3 workstation_2) (is supply_0 valve) (adjacent l0_5 l0_6) (adjacent l1_3 l1_4) (adjacent l2_1 l3_1) (adjacent l3_2 l3_3) (available box_2) (adjacent l2_3 l1_3) (adjacent l3_4 l3_3) (empty box_8) (available box_4) (at supply_4 l3_3) (at supply_13 l3_3) (adjacent l2_3 l3_3) (adjacent l4_4 l3_4) (adjacent l1_4 l1_5) (adjacent l1_5 l1_4) (adjacent l1_1 l2_1) (adjacent l0_4 l1_4) (adjacent l0_6 l0_7) (at supply_5 l3_3) (adjacent l2_2 l2_3) (free_arms agent_0) (adjacent l3_4 l2_4) (adjacent l3_2 l2_2) (adjacent l2_3 l2_4) (adjacent l1_3 l1_2) (adjacent l2_2 l1_2) (empty box_4) (adjacent l0_2 l1_2) (adjacent l1_0 l1_1) (at workstation_1 l0_2) (adjacent l1_2 l1_3) (adjacent l0_5 l0_4) (adjacent l3_0 l2_0) (adjacent l0_0 l1_0) (empty box_1) (adjacent l2_2 l3_2) (adjacent l1_4 l0_4) (is supply_4 bolt) (loaded_to supply_14 workstation_0) (at box_8 l3_3) (at supply_1 l3_3) (adjacent l2_1 l1_1) (available box_6) (adjacent l1_4 l1_3) (is supply_3 bolt) (available box_7) (at box_2 l3_3) (adjacent l2_0 l1_0) (at supply_2 l3_3) (at supply_8 l3_3) (at agent_0 l3_3) (adjacent l2_1 l2_0) (at box_7 l3_3) (adjacent l1_0 l0_0) (is supply_10 gear) (adjacent l1_2 l2_2) (loaded_to supply_11 workstation_0) (adjacent l3_4 l4_4) (at box_3 l3_3) (at supply_7 l3_3) (adjacent l3_1 l3_2) (available box_3) (adjacent l0_6 l0_5) (adjacent l1_5 l0_5) (at warehouse_0 l3_3) (adjacent l3_0 l3_1) (at supply_3 l3_3) (loaded_to supply_5 workstation_0))
  (:goal (and (has workstation_2 tool) (has workstation_2 circuit) (has workstation_0 valve) (has workstation_1 tool) (has workstation_2 valve) (has workstation_0 tool) (has workstation_2 gear) (has workstation_1 valve) (has workstation_1 bolt)))
)

; plan
1. (load_box agent_0 warehouse_0 box_3 l3_3)
   deleted: (free_arms agent_0) (at box_3 l3_3) (available box_3)
   added: (box_carried_by box_3 agent_0)
   goals met: 0 of 9
2. (fill_box agent_0 warehouse_0 box_3 supply_12 l3_3)
   deleted: (empty box_3) (at supply_12 l3_3)
   added: (contains box_3 supply_12)
   goals met: 0 of 9
3. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 0 of 9
4. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 0 of 9
5. (move agent_0 l3_1 l3_0)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_0)
   goals met: 0 of 9
6. (load_supply_to_workstation agent_0 workstation_2 box_3 supply_12 l3_0 circuit)
   deleted: (contains box_3 supply_12)
   added: (loaded_to supply_12 workstation_2) (empty box_3) (has workstation_2 circuit)
   goals met: 1 of 9
7. (move agent_0 l3_0 l3_1)
   deleted: (at agent_0 l3_0)
   added: (at agent_0 l3_1)
   goals met: 1 of 9
8. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 1 of 9
9. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 1 of 9
10. (fill_box agent_0 warehouse_0 box_3 supply_11 l3_3)
   deleted: (empty box_3) (at supply_11 l3_3)
   added: (contains box_3 supply_11)
   goals met: 1 of 9
11. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 1 of 9
12. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 1 of 9
13. (move agent_0 l3_1 l3_0)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_0)
   goals met: 1 of 9
14. (load_supply_to_workstation agent_0 workstation_2 box_3 supply_11 l3_0 gear)
   deleted: (contains box_3 supply_11)
   added: (loaded_to supply_11 workstation_2) (empty box_3) (has workstation_2 gear)
   goals met: 2 of 9
15. (move agent_0 l3_0 l3_1)
   deleted: (at agent_0 l3_0)
   added: (at agent_0 l3_1)
   goals met: 2 of 9
16. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 2 of 9
17. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 2 of 9
18. (fill_box agent_0 warehouse_0 box_3 supply_5 l3_3)
   deleted: (empty box_3) (at supply_5 l3_3)
   added: (contains box_3 supply_5)
   goals met: 2 of 9
19. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 2 of 9
20. (move agent_0 l3_2 l2_2)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l2_2)
   goals met: 2 of 9
21. (move agent_0 l2_2 l1_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l1_2)
   goals met: 2 of 9
22. (move agent_0 l1_2 l0_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l0_2)
   goals met: 2 of 9
23. (load_supply_to_workstation agent_0 workstation_1 box_3 supply_5 l0_2 bolt)
   deleted: (contains box_3 supply_5)
   added: (loaded_to supply_5 workstation_1) (empty box_3) (has workstation_1 bolt)
   goals met: 3 of 9
24. (move agent_0 l0_2 l1_2)
   deleted: (at agent_0 l0_2)
   added: (at agent_0 l1_2)
   goals met: 3 of 9
25. (move agent_0 l1_2 l2_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l2_2)
   goals met: 3 of 9
26. (move agent_0 l2_2 l3_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l3_2)
   goals met: 3 of 9
27. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 3 of 9
28. (fill_box agent_0 warehouse_0 box_3 supply_1 l3_3)
   deleted: (empty box_3) (at supply_1 l3_3)
   added: (contains box_3 supply_1)
   goals met: 3 of 9
29. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 3 of 9
30. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 3 of 9
31. (move agent_0 l3_1 l3_0)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_0)
   goals met: 3 of 9
32. (load_supply_to_workstation agent_0 workstation_2 box_3 supply_1 l3_0 valve)
   deleted: (contains box_3 supply_1)
   added: (loaded_to supply_1 workstation_2) (empty box_3) (has workstation_2 valve)
   goals met: 4 of 9
33. (move agent_0 l3_0 l3_1)
   deleted: (at agent_0 l3_0)
   added: (at agent_0 l3_1)
   goals met: 4 of 9
34. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 4 of 9
35. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 4 of 9
36. (fill_box agent_0 warehouse_0 box_3 supply_2 l3_3)
   deleted: (empty box_3) (at supply_2 l3_3)
   added: (contains box_3 supply_2)
   goals met: 4 of 9
37. (leave_box agent_0 box_3 warehouse_0 l3_3)
   deleted: (box_carried_by box_3 agent_0)
   added: (at box_3 l3_3) (free_arms agent_0) (available box_3)
   goals met: 4 of 9
38. (load_box agent_0 warehouse_0 box_8 l3_3)
   deleted: (free_arms agent_0) (at box_8 l3_3) (available box_8)
   added: (box_carried_by box_8 agent_0)
   goals met: 4 of 9
39. (fill_box agent_0 warehouse_0 box_8 supply_6 l3_3)
   deleted: (empty box_8) (at supply_6 l3_3)
   added: (contains box_8 supply_6)
   goals met: 4 of 9
40. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 4 of 9
41. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 4 of 9
42. (move agent_0 l3_1 l3_0)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_0)
   goals met: 4 of 9
43. (load_supply_to_workstation agent_0 workstation_2 box_8 supply_6 l3_0 tool)
   deleted: (contains box_8 supply_6)
   added: (loaded_to supply_6 workstation_2) (empty box_8) (has workstation_2 tool)
   goals met: 5 of 9
44. (move agent_0 l3_0 l3_1)
   deleted: (at agent_0 l3_0)
   added: (at agent_0 l3_1)
   goals met: 5 of 9
45. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 5 of 9
46. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 5 of 9
47. (fill_box agent_0 warehouse_0 box_8 supply_0 l3_3)
   deleted: (empty box_8) (at supply_0 l3_3)
   added: (contains box_8 supply_0)
   goals met: 5 of 9
48. (move agent_0 l3_3 l2_3)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l2_3)
   goals met: 5 of 9
49. (move agent_0 l2_3 l1_3)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l1_3)
   goals met: 5 of 9
50. (move agent_0 l1_3 l1_2)
   deleted: (at agent_0 l1_3)
   added: (at agent_0 l1_2)
   goals met: 5 of 9
51. (move agent_0 l1_2 l0_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l0_2)
   goals met: 5 of 9
52. (load_supply_to_workstation agent_0 workstation_1 box_8 supply_0 l0_2 valve)
   deleted: (contains box_8 supply_0)
   added: (loaded_to supply_0 workstation_1) (empty box_8) (has workstation_1 valve)
   goals met: 6 of 9
53. (move agent_0 l0_2 l1_2)
   deleted: (at agent_0 l0_2)
   added: (at agent_0 l1_2)
   goals met: 6 of 9
54. (move agent_0 l1_2 l2_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l2_2)
   goals met: 6 of 9
55. (move agent_0 l2_2 l3_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l3_2)
   goals met: 6 of 9
56. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 6 of 9
57. (leave_box agent_0 box_8 warehouse_0 l3_3)
   deleted: (box_carried_by box_8 agent_0)
   added: (at box_8 l3_3) (free_arms agent_0) (available box_8)
   goals met: 6 of 9
58. (load_box agent_0 warehouse_0 box_3 l3_3)
   deleted: (free_arms agent_0) (at box_3 l3_3) (available box_3)
   added: (box_carried_by box_3 agent_0)
   goals met: 6 of 9
59. (move agent_0 l3_3 l3_2)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l3_2)
   goals met: 6 of 9
60. (move agent_0 l3_2 l2_2)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l2_2)
   goals met: 6 of 9
61. (move agent_0 l2_2 l1_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l1_2)
   goals met: 6 of 9
62. (move agent_0 l1_2 l1_1)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l1_1)
   goals met: 6 of 9
63. (move agent_0 l1_1 l1_0)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l1_0)
   goals met: 6 of 9
64. (move agent_0 l1_0 l0_0)
   deleted: (at agent_0 l1_0)
   added: (at agent_0 l0_0)
   goals met: 6 of 9
65. (load_supply_to_workstation agent_0 workstation_0 box_3 supply_2 l0_0 valve)
   deleted: (contains box_3 supply_2)
   added: (loaded_to supply_2 workstation_0) (empty box_3) (has workstation_0 valve)
   goals met: 7 of 9
66. (move agent_0 l0_0 l1_0)
   deleted: (at agent_0 l0_0)
   added: (at agent_0 l1_0)
   goals met: 7 of 9
67. (move agent_0 l1_0 l1_1)
   deleted: (at agent_0 l1_0)
   added: (at agent_0 l1_1)
   goals met: 7 of 9
68. (move agent_0 l1_1 l1_2)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l1_2)
   goals met: 7 of 9
69. (move agent_0 l1_2 l2_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l2_2)
   goals met: 7 of 9
70. (move agent_0 l2_2 l3_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l3_2)
   goals met: 7 of 9
71. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 7 of 9
72. (fill_box agent_0 warehouse_0 box_3 supply_7 l3_3)
   deleted: (empty box_3) (at supply_7 l3_3)
   added: (contains box_3 supply_7)
   goals met: 7 of 9
73. (move agent_0 l3_3 l2_3)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l2_3)
   goals met: 7 of 9
74. (move agent_0 l2_3 l1_3)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l1_3)
   goals met: 7 of 9
75. (move agent_0 l1_3 l1_2)
   deleted: (at agent_0 l1_3)
   added: (at agent_0 l1_2)
   goals met: 7 of 9
76. (move agent_0 l1_2 l0_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l0_2)
   goals met: 7 of 9
77. (load_supply_to_workstation agent_0 workstation_1 box_3 supply_7 l0_2 tool)
   deleted: (contains box_3 supply_7)
   added: (loaded_to supply_7 workstation_1) (empty box_3) (has workstation_1 tool)
   goals met: 8 of 9
78. (move agent_0 l0_2 l1_2)
   deleted: (at agent_0 l0_2)
   added: (at agent_0 l1_2)
   goals met: 8 of 9
79. (move agent_0 l1_2 l2_2)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l2_2)
   goals met: 8 of 9
80. (move agent_0 l2_2 l3_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l3_2)
   goals met: 8 of 9
81. (move agent_0 l3_2 l3_3)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_3)
   goals met: 8 of 9
82. (fill_box agent_0 warehouse_0 box_3 supply_8 l3_3)
   deleted: (empty box_3) (at supply_8 l3_3)
   added: (contains box_3 supply_8)
   goals met: 8 of 9
83. (move agent_0 l3_3 l2_3)
   deleted: (at agent_0 l3_3)
   added: (at agent_0 l2_3)
   goals met: 8 of 9
84. (move agent_0 l2_3 l1_3)
   deleted: (at agent_0 l2_3)
   added: (at agent_0 l1_3)
   goals met: 8 of 9
85. (move agent_0 l1_3 l1_2)
   deleted: (at agent_0 l1_3)
   added: (at agent_0 l1_2)
   goals met: 8 of 9
86. (move agent_0 l1_2 l1_1)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l1_1)
   goals met: 8 of 9
87. (move agent_0 l1_1 l1_0)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l1_0)
   goals met: 8 of 9
88. (move agent_0 l1_0 l0_0)
   deleted: (at agent_0 l1_0)
   added: (at agent_0 l0_0)
   goals met: 8 of 9
89. (load_supply_to_workstation agent_0 workstation_0 box_3 supply_8 l0_0 tool)
   deleted: (contains box_3 supply_8)
   added: (loaded_to supply_8 workstation_0) (empty box_3) (has workstation_0 tool)
   goals met: 9 of 9
